app/views/users/_gender_zipcode.html.haml

SELECT "genders".id FROM "genders" INNER JOIN "interests" ON "genders"."id" = "interests"."gender_id" WHERE "interests"."user_id" = 1
---
      = label_tag gender.title
      = check_box_tag 'user[gender_interest_ids][]', gender.id, @user.gender_interest_ids.include?(gender.id)