app/controllers/users_controller.rb

  def search
    @genders = Gender.all
---
SELECT "genders".* FROM "genders"

  def gender_zipcode
    @user = current_user
    @genders = Gender.all
---
SELECT "genders".* FROM "genders"

  def update
    @user = User.find(params[:id])
    # FIX ROUTE
    respond_to do |format|
      if @user.update_attributes(params[:user]) && current_user.gender_interests.any?
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "genders".* FROM "genders" INNER JOIN "interests" ON "genders"."id" = "interests"."gender_id" WHERE "interests"."user_id" = 1
SELECT COUNT(*) FROM "genders" INNER JOIN "interests" ON "genders"."id" = "interests"."gender_id" WHERE "interests"."user_id" = 1
UPDATE "users" SET "zipcode" = 'M2 1DW', "location" = 'Manchester, England', "latitude" = 53.4819112, "longitude" = -2.2428841, "updated_at" = '2014-05-26 17:09:49.918836' WHERE "users"."id" = 2